MOD_VERSION = "0.0.1"

CHANGE_LOG = <<LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，
但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，
则不会记录在内。
#==============================================================================#
游戏特色：
完全重置的全新的口袋妖怪同人游戏
对战难度向口袋妖怪同人游戏
1-8代的全精灵以及这些精灵在9代获得的进化型
一些原创的精灵以及地区形态
经过大量挑选/删除/修改的原版特性/技能/物品
没有Mega进化/Z技能/极巨化/钛晶化等噱头系统
几百个全新的原创特性
几百个全新的原创技能
一些全新的原创物品
每一只精灵的种族值/特性/技能池都经过精心调整
特性和技能的合法性检测，杜绝作弊的可能性
经过优化的属性克制表
经过定制化调整的战斗AI
类Elite Redux的多特性系统，精灵所拥有的所有特性都会同时生效
类Reborn系的场地系统，会随机生成一个对对方有利的场地
类Exceeded的多物品系统，某些精灵可以携带多个物品
类Elite Redux的精灵导航，可以直接获得想要的精灵，而无需进入战斗捕捉
开局即获得除神兽之外的全图鉴资料
经过完全修改的精灵图鉴，可以查到你需要的任何精灵的资料
新的技能图鉴，可以查到你需要的任何技能的资料
敌我双方均没有努力值
敌我双方均没有个体值
敌我双方均没有性格加成
新的经过优化的风格点数来自行分配加点
经过优化的技能学习方式，现在技能只分为升级技能和教学技能
动态等级，对方的精灵的等级将始终大于或者等于玩家队伍中等级最高的精灵的等级
阶段性等级上限
替换回血机制，进行替换时，精灵将会回复一定的HP
濒死复活机制，濒死的精灵经过一定的回合数之后会复活
完胜机制，对战结束时，若队伍中有濒死的精灵，则视为失败
物品恢复机制，战斗中消耗的物品将在战斗后恢复
战后回复机制，和训练师的战斗结束后，所有精灵会回复30%HP和异常
精灵唯一性机制，现在同一种类的精灵，玩家只能拥有一只，获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时可取回
战斗模拟器功能，可记录下所有对战过的训练师的队伍，而且也可自行为AI配置队伍，或者加载其他玩家配置的队伍进行模拟对战
部族系统，每一只精灵有它所属的部族，同一队伍的部族数达到一定时将获得额外的效果
时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取
塔罗牌困难模式，开启后对方将会获得一个Buff，此为此游戏的唯一一个不公平选项，可自行选择是否开启
游戏加速功能，快捷键Q，但是战斗不会被加速
快速略过对话功能，快捷键V
快速存档功能，快捷键W
多存档功能
可直接修改精灵的昵称
技能伤害显示
战斗中显示各项参数
可直接快速放弃对战
战斗中无法使用物品
固定连战模式
无限的背包空间
背包物品搜索功能，快捷键D
快速注册物品，快捷键R
礼物系统
精灵跟随系统
经过优化的HM，不用再带工具宠
可选的手动进化功能

v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
12.添加了特性的合法性检测，会自动移除非法特性
13.现在捕捉精灵后，会正确显示精灵的特性了
14.现在精灵进化后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在官方游戏的版本也会自动更新生成了
21.加入了场地系统，目前共有11个场地
22.现在可以在游戏中按Q键进行2倍速加速了
23.现在可以在游戏中通过按住V键快速略过对话了
24.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
25.现在在游戏中可以按住X键（BACK）进行奔跑
26.修复了Battle Guide中和多特性相关的文本指引
27.修复了大量的Pokémon的e上没有重音符号的文本问题
28.现在最多可以支持精灵在战斗中拥有8个技能的情况了
29.现在Q键的加速将不会对战斗生效
30.现在在游戏中快速存档的按键是W键
31.修复了背包搜索功能中的文本无法被正确翻译的问题
32.现在在背包中搜索物品时，如果搜索不到结果，也会出现提示了
33.现在可以在背包中按R键快速注册物品了
34.修复了物品快捷注册的一些Bug，因为某些非重要物品也是可以注册的
35.现在当精灵携带了某个物品时会额外获得一个特性
36.现在当开启困难模式时，某个训练师的所有精灵会拥有三个特性
37.现在梦幻的特性不再是复制对手的特性，而是获得对手的特性
38.现在梦幻会在对手出场时立即获得对手的特性，而不是在回合结束时才获得
39.现在某个空间的效果为回合结束时获得一个特性
40.现在在获得新特性时，能发动的特性都会发动了
41.修改某个空间效果的发动顺序，现在这个空间会在回合结束时最先发动
42.现在精灵的概览界面会显示精灵当前拥有的所有特性了
43.修复某个空间效果因为对手死亡时而导致的Bug
44.现在对手训练师的精灵的等级会始终大于或者等于玩家队伍中的精灵的最高等级
45.现在对手训练师的队伍将会更强（不是非法的数值怪或者各种不公平的效果）
46.现在在战斗结束时，如果玩家有精灵在战斗中濒死了，则视为战斗失败
47.现在濒死的精灵在一定回合数之后会复活
48.现在替换下场的精灵会回复一定的HP
49.现在某个特性的生效时间由第6回合改为第4回合
50.现在加入了礼物系统
51.现在可以输入hyena1获得1只路边的野狗
52.现在可以输入psyduck10获得1只10级的我最喜欢的死鸭子
53.现在可以输入pokeball5获得5个精灵球
54.现在在精灵导航中无需进入对战即可直接获得精灵
55.现在可以按F快速骑上自行车
56.现在和训练师的战斗结束后所有精灵会回复30%HP
57.现在和训练师的战斗结束后所有精灵会回复异常
58.修改Documents菜单选项名为Tools
59.现在同一种类的精灵，玩家只能拥有一只
60.现在获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时可取回该精灵
61.加入了时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取
62.加入了战斗模拟器功能，可随时将玩家当前的队伍加载到战斗模拟器中，然后镜像对战或者使用其他队伍进行对战
63.现在战斗模拟器可加载的队伍数量没有上限，不仅可以随时删除，并且全存档通用
63.现在战斗模拟器也可以加载其他玩家配置的队伍了
64.现在战斗模拟器支持自定义对战模式了（1v1/2v2/1v2/2v2）
65.现在战斗模拟器支持记录对战过的训练师的队伍了，可以自行选择是否记录
66.现在从时间胶囊中取回的精灵等级将不会超过当前阶段的上限
67.现在随机模式已被禁用
68.修改了部分按键说明文本以和当前游戏匹配
69.现在在选择主角外观时将不允许取消选择
70.修改了科学胖子的对话以和当前游戏匹配
71.修复了初始城镇精灵中心里护士对话文本的一个语法错误
72.修复了使用天气技能会报错的Bug，这个Bug为官方版本中就存在的Bug
73.取消了在使用电脑的取出功能时点击队伍出现的无意义的文本
74.

更新计划：
时间胶囊教程
战斗模拟器教程
Dimension D教程
将精灵从Dimension D移动到时间胶囊中
1.重修pbMessage的选择功能，包括概览界面的特性列表显示、背包的物品搜索功能
2.1只精灵也能进行双打，优先级不高，因为很少有身上只有一只精灵的情况
3.少于4个技能时选择技能Bug
4.更多的战斗信息显示，包括显示技能的预计伤害
5.快速扔球
6.固定为连战模式
7.导航教程
8.队伍界面可以直接修改HP
9.队伍界面可以直接回忆技能
10.队伍界面可以直接教学技能
11.队伍界面可以直接分配风格点数
12.导航获得精灵需要消耗一个精灵球
13.精灵球的捕获率改为50%
15.随身电脑
17.自由单双打
19.获胜和失败计数
20.导航额外增加随机获得一只的选项
24.概览界面可以转到图鉴的特性和能力界面
重复对战功能
走路和跑步模式默认切换
默认跑步模式
默认不起昵称
自定义入场提示
自定义离场提示
命中要害红色显示
AI控制玩家对战
双打模式
特性的强化效果一次出场只会发动一次
强化类技能一次出场只能使用一次
同一边可以同时显示多个特性条
氛围加成，最多属性的属性威力增加10%
ROWE的STAB机制，使用的技能与我方队伍里其他精灵相同属性，就会有加成（单属性加成20%倍，多属性加成10%倍），使用的技能与对方队伍里其他精灵相同属性，就会有削弱（单属性就变成10%，多属性就是5%）
携带了传说石板的阿尔宙斯被攻击时会切换成攻击技能的属性
乔伊直接赠送全物品
无限的PC盒子
永久喷雾
无限离洞绳
全异常状态应用睡眠条款
LOGGER

CHANGE_LOG.gsub!("\n", "\r\n")

file = File.open("release_version.txt", "wb")
file.write(Settings::GAME_VERSION)
file.close

file = File.open("release_version_mod.txt", "wb")
file.write(CHANGE_LOG)
file.close