=begin
重修pbMessage的选择功能，可接受Array或者Hash
更多的战斗信息显示，包括显示技能的预计伤害
队伍界面可以直接修改HP/异常状态/分配风格点数
自定义入场/离场提示
同一边可以同时显示多个特性条
Adoption Center
教程[时间胶囊/战斗模拟器/特性记录器/STAB系统，现在单属性精灵的本系加成为1.5倍，多属性精灵的本系加成为1.25倍，新的技能威力属性加成机制，使用的技能与攻击方队伍里的其他未处于濒死状态的精灵具有相同的属性，就会有加成（每只单属性精灵加成10%，多属性精灵加成5%），新的技能威力属性削减机制，使用的技能与被击方队伍里的其他未处于濒死状态的精灵具有相同的属性，就会有削减（每只单属性精灵削减10%，多属性精灵削减5%）]
整理002_My_Helpers和003_Field_Effect
=end
MOD_VERSION = "0.2.2"

CHANGE_LOG = <<-LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，则不会记录在内。
#==============================================================================#
难度哲学：
我个人的难度哲学是尽量不通过给NPC任何优势，而是通过合理的配队和完善的AI来实现难度。

游戏特色：
完全包括Pokémon Tectonic官方游戏的全部内容
完全重置的全新的口袋妖怪同人游戏
对战难度向口袋妖怪同人游戏
1-8代的全精灵以及这些精灵在9代获得的进化型
一些原创的精灵以及地区形态
经过大量挑选/删除/修改的原版特性/技能/物品
没有Mega进化/Z技能/极巨化/钛晶化系统
几百个全新的原创特性/原创技能
一些全新的原创物品
每一只精灵的种族值/特性/技能池都经过精心调整
各种反作弊检测以及特性和技能的合法性检测，杜绝作弊的可能性
经过优化的属性克制表
经过优化的异常状态效果
经过优化的能力等级算法
经过优化的命中要害算法
经过优化的属性克制伤害算法（请查看v0.2.0更新说明）
经过定制化调整的战斗AI，AI不会作弊，也不会窥屏
类Elite Redux的多特性系统，精灵所拥有的所有特性都会同时生效
类Reborn系的场地系统（已移除，暂未生效）
类Exceeded的多物品系统，某些精灵可以携带多个物品
类Elite Redux的精灵导航，可以直接获得想要的精灵，而无需进入战斗捕捉
类R.O.W.E.的STAB系统，更加合理的本系加成算法，队伍中的其他精灵将会影响技能的威力（请查看v0.1.0更新说明）
经过完全修改的精灵图鉴，可以查询你需要的任何有关精灵的资料
开局即获得除神兽之外的全图鉴资料
新的技能图鉴，可以查询你需要的任何有关技能的资料
新的特性图鉴，可以查询你需要的任何有关特性的资料
新的物品图鉴，可以查询你需要的任何有关可携带物品的资料
敌我双方均没有努力值/个体值/性格加成
新的经过优化的风格点数来自行分配加点
经过优化的技能学习方式，现在技能只分为升级技能和教学技能
动态等级，对方的精灵的等级将始终大于或者等于玩家队伍中等级最高的精灵的等级
阶段性等级上限
物品条款，队伍里的精灵不能携带相同的物品（已移除，暂未生效）
睡眠条款，队伍里的精灵不能陷入相同的异常状态
经验分配器功能，经验值绝对不会被浪费，精灵等级达到上限并且获得经验值时，经验值将会被存储在经验分配器中，可利用经验分配器中的经验制作经验糖果
替换回血机制，进行替换时，精灵将会回复10%HP
濒死复活机制，濒死的精灵经过10回合之后会复活（每只精灵只会触发1次）
对战完胜机制，对战结束时，若队伍中有在战斗中濒死的精灵，则视为失败
物品恢复机制，战斗中消耗的物品将在战斗后恢复
战后回复机制，和训练师的战斗结束后，所有精灵会回复30%HP、异常以及全部技能的全部PP
精灵唯一性机制，同一种类的精灵，玩家只能拥有一只，获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时才可取回
战斗模拟器功能，可记录下所有对战过的训练师的队伍，而且也可自行为AI配置队伍，或者加载其他玩家配置的队伍进行模拟对战
特性记录器功能，在和训练师的对战中，特性记录器会在对手被击败时记录对手的特性
部族系统，每一只精灵有它所属的部族，同一队伍的部族数达到5个时将获得额外的效果
时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取
火箭队模式，和训练师的对战胜利时，可以从对手的队伍中抢走一只精灵，使用密码rocket开启
特性自选模式，玩家可以用特性记录器中记录的特性来修改自己的精灵的特性，使用密码customabil开启
全双打模式，开启全双打模式后，所有战斗都会变成双打，使用密码doublebattle开启
塔罗牌困难模式，开启后对方将会获得一个Buff，此为此游戏的唯一一个不公平选项，可自行选择是否开启
可选择性跳过的Boss战
游戏加速功能，快捷键Q，但是战斗不会被加速
快速略过对话功能，快捷键V
快速存档功能，快捷键W
多存档功能
文本关键字高亮系统
可恢复的随身急救包
查看自身队伍功能，队伍界面按D
可直接修改精灵的昵称
可直接更换精灵的球种
战前敌方队伍查看功能
技能造成的伤害显示
战斗中显示各项参数
可直接快速放弃对战
战斗中无法使用物品
固定连战模式
无限的背包空间
背包物品搜索功能，快捷键D
快速注册物品，快捷键R
快速重启，快捷键F12
截图功能，快捷键F8
无限的电脑盒子数
精灵寄放系统的搜索功能
礼物系统
精灵跟随系统
经过优化的HM系统
可选的手动进化功能
其他各种微小的机制改进/细节优化/Qol提升

v0.2.2
1.Bioengineering现在只有当精灵的等级大于等于30级时才会发动
2.现在在学习技能时会显示要学习的技能是否和精灵匹配（物攻手=>物攻技能，特攻手=>特攻技能）
3.现在开出替身时将不会再使全局的文字速度变慢了
4.加入了全双打模式，现在可以输入密码doublebattle开启
5.现在可以输入密码disabledouble关闭全双打模式
6.现在使用X-Ray扫描对手的队伍时，会正确显示对手的精灵携带的物品了
7.

v0.2.1
1.现在NPC将不会再获得玩家的部族效果
2.现在濒死复活机制每只精灵只能触发一次
3.现在只有当游戏语言为中文时才会打印出更新日志
4.现在对手训练师的精灵都会至少携带文柚果
5.现在战斗模拟器中的随机对战只有明确选择了对战规则才会开始战斗
6.下调战斗模拟器中随机生成的精灵的种族值下限（450→400）
7.现在和训练师的战斗结束后，有一定几率受到更强的战后回复机制的回复效果（30%几率→50%HP，20%几率→100%HP）
8.再次增加击败对手训练师的精灵或者化身时获得的经验值，现在经验值为原本的3倍
9.再次增加战斗获胜时获得的金钱，现在金钱为原本的3倍
10.为伊布分配了第二特性，现在伊布的第二特性为Bioengineering
11.现在当精灵因为某些效果变为另一种精灵时，会有动画效果了
12.现在当精灵因为某些效果变为另一种精灵时，会立即重新计算速度了
13.修复了当切换精灵后，在其他精灵的概览界面查看特性时，该精灵的特性会显示成切换上场的精灵的特性的Bug
14.修复了当切换精灵后，在其他精灵的概览界面查看物品时，该精灵的物品会显示成切换上场的精灵的物品的Bug
15.现在夜盗火蜥的第一特性为Backfire
16.现在焰后蜥的第一特性为Backfire
17.现在特殊技能也会触发Cursed Tail（修改成和特性描述一致）
18.现在Cursed Tail的警告会在整场战斗中持续
19.现在当攻击者濒死时，Cursed Tail将不会再发动了
20.现在当攻击者濒死时，Feedback将不会再发动了
21.回退特殊技能也会触发Cursed Tail的修改，因为这实在太过强大了（Cursed Tail现在依然只会被物理技能触发）
22.优化了用于胜利和失败计数的计算逻辑（已有存档的胜利计数和战斗模拟器中的计数会被清零，并不会影响实际的游戏体验）
23.修改了部分文本的措辞
24.现在不需要VIP Card也可以在商店购买文柚果

v0.2.0
1.修改了大量的游戏中的文本以使措辞更准确和精简
2.修复了当玩家的精灵被野生的精灵击倒时也会触发惩罚机制的Bug
3.更新记录文档里增加了我个人的难度哲学的说明
4.修复了某个方法中的文本无法被正确翻译的Bug
5.物品条款已被移除，因为NPC可以携带相同的物品，这是不公平的
6.现在特性记录器的提示文本将只会在特性自选模式开启的时候显示（效果依然生效）
7.更新了游戏的Credits
8.从Tools中移除了Team Switcher，因为距离Team Switcher的完成还遥遥无期
9.触发击杀野生精灵的惩罚机制的阈值提高到10（击杀第11只时才会被惩罚）
10.现在战斗获胜获得的金钱翻倍
11.现在战斗失败不会再失去金钱
12.现在所有球的捕获率都提升为原来的3倍
13.现在击杀野生的精灵时，将会出现提示会有惩罚的文本
14.现在属性克制的倍率不再是乘算，而是使用加算（如2/4/8/16/32... => 2/3/4/5/6...）

v0.1.9
1.修复了将队伍中的精灵送入时间胶囊时可能会意外使精灵直接消失的Bug
2.现在在任何情况下都不再可以随机获得游戏中已实装但是并未分配给任何精灵的特性
3.现在特性图鉴不再显示玩家无法获得的特性了
4.现在特性图鉴不再显示已经被弃用的特性了
5.现在Lambert的索罗亚在战斗中将会更好的进行欺骗
6.修复了幻觉特性的精灵处于幻觉时，查看信息会显示多余无效的效果的Bug
7.修复了在某些极端情况下，精灵明明没有主特性，但是却会被视为有主特性的Bug
8.修改了某些塔罗牌战斗开场的提示文本
9.将索罗亚的第二特性从Territorial改为Relentless Pursuit
10.将索罗亚克的第二特性从Territorial改为Relentless Pursuit
11.现在精灵因为异常状态而导致濒死时，将不会再显示无意义的多余文本提示
12.修复了将幻觉特性的精灵换上场时可能会显示不正确的文本的Bug
13.修复了当幻觉被打破时，查看信息所显示的特性不会刷新的Bug
14.修复了Pluripotence复制到的特性不会立刻发动的Bug

v0.1.8
1.现在击败对手训练师的精灵或者化身时，获得的经验值翻倍
2.优化了睡眠条款的检查逻辑，现在睡眠条款的优先级为最低
3.修改自动存档默认为不开启，因为在某些情况下自动存档会使游戏陷入尴尬的情况
4.修复了将精灵加入队伍时，会错误的将原本的精灵送入Dimension D中的Bug
5.修复了在某些情况下将精灵送入电脑中时，会提示两次是否要取下精灵携带的物品的提示
6.修复了火箭队模式下抢夺对手的精灵时，如果队伍已满并选择将抢夺的精灵加入队伍中时游戏崩溃的Bug

v0.1.7
1.因为启用了新的游戏加密方式，所以移除开始新游戏时的要求输入合法来源的密码
2.现在在开始新游戏时将会出现一段提示谨防受骗的文本
3.修复了在清除不再使用的密码时可能导致的使游戏意外崩溃的Bug
4.现在在加载存档，并且改变游戏语言时，将不会再因为游戏数据被异常转换而使游戏崩溃了
5.现在在删除存档时，提示文本不会再显示过快导致无法看清内容了
6.修复了在删除存档时的提示文本的语法错误
7.修复了在加载存档时的提示文本的语法错误
8.现在在尝试更改游戏的语言时，选择语言完成后，将会退出相应的菜单
9.现在在更改游戏的语言后，将会关闭开始菜单以进行刷新
10.现在游戏开始界面的检查更新只会在游戏语言为中文时才会显示
11.现在在开始界面的菜单里将不会再显示选项
12.现在首次击杀野生的精灵将不会再触发惩罚机制
13.现在可以通过逃跑直接跳过和化身的战斗
14.现在在和化身的战斗开始时，将会出现一条提示可以直接跳过战斗并获胜的文本
15.现在在和训练师的战斗开始时，将会出现一条提示必须完胜的文本

v0.1.6
1.现在游戏支持多字体，当游戏语言为中文时，将会使用特殊的中文字体
2.现在当游戏的语言为中文时，将会使用Fusion Pixel字体
3.现在因为非完胜而战败时，将会显示额外的提示文本了
4.取消密码whosyourdaddy
5.取消密码nodaddy
6.修复了因取消密码而可能导致的潜在非预期行为，即密码已取消，但是密码的效果还在
7.启用了新的游戏加密方式，基本上不论是游戏本体还是游戏存档都不再可能被修改了（未经测试）
8.调整游戏的分发方式，以使玩家能够更加方便的更新游戏
9.移除了从来没有使用过的Didact Gothic字体

v0.1.5
1.修复了当惩罚机制被触发时，对手训练师的精灵数据异常的Bug
2.现在对手训练师队伍里的精灵会保持一致的等级
3.现在对战模拟器的由随机的精灵组成的队伍的对战功能将有更多的可用精灵了
4.为战斗模拟器中的战斗添加了报错补偿功能，现在如果战斗模拟器中的战斗发生错误，将不会再使游戏崩溃了
5.修复了精灵导航中的一个Typo
6.在开始页面增加了检查更新的功能

v0.1.4
1.修复了翻译系统无法提取事件中的脚本中的文本的Bug
2.实现了中文的自动换行功能，现在应该不会再出现中文无法自动换行的问题了
3.现在特性图鉴会跟随游戏所使用的语言自动刷新，不必再重启游戏才会应用更改
4.现在物品图鉴会跟随游戏所使用的语言自动刷新，不必再重启游戏才会应用更改
5.现在高亮系统应该已经可以对中文生效了（未测试）
6.修复了在某些情况下获取随机特性会获取到重复的特性的Bug
7.战斗模拟器增加了可以和某一个随机队伍对战的功能
8.战斗模拟器增加了可以和由随机精灵组成的队伍对战的功能
9.战斗模拟机现在会统计玩家获胜和失败的次数了
10.修复了战斗模拟器相关的一些语法不合适的文本
11.现在战斗模拟器中的失败将不会再被计入通用的失败计数
12.现在通用的胜利失败统计和战斗模拟器中的胜利失败统计是分开计数的，通用的胜利失败统计可在队伍界面按D键查看
13.修复了游戏语言为中文时战斗模拟器无法使用的Bug

v0.1.3
1.现在动态等级会对对手队伍里的所有精灵生效
2.现在对手的所有精灵都会在战斗开始之前被治疗
3.修复了各种复制精灵的情况时不是深度复制的Bug
4.现在可以输入密码whosyourdaddy开启无敌模式
5.现在可以输入密码nodaddy关闭无敌模式
6.现在每击杀一只野生的精灵，将会使对手训练师的队伍的等级增加1级
7.修复了反作弊功能永远不会启动的Bug

v0.1.2
1.加入了中文拼音输入法，现在即使不借助外部输入法也可以在光标模式中输入中文了
2.在输入模式的说明文本中添加了可以使用光标模式输入中文的提示
3.修复了当不可使用特性胶囊时使用特性胶囊时游戏崩溃的Bug（此为官方版本存在的Bug）
4.现在特性胶囊已被禁用，当尝试使用特性胶囊时将会显示不可用的提示说明文本
5.现在通过火箭队模式抢夺的精灵将不会携带物品
6.现在通过火箭队模式抢夺的精灵将不会附带额外属性
7.现在通过火箭队模式抢夺的精灵将不会附带额外特性
8.现在通过火箭队模式抢夺的精灵的技能将会被重置
9.修复了某些情况下胜利计数无法正常计数的Bug
10.修复了在火箭队模式的某些情况下，即使胜利了也无法抢夺对手精灵的Bug
11.加入了物品条款，现在队伍里的精灵不能再携带相同的物品
12.加入了睡眠条款，现在队伍里的精灵不能再陷入相同的异常状态

v0.1.1
1.现在在电脑中查看精灵时，会显示精灵下一次进化的等级了
2.修复了电脑中的精灵特性显示不正确的Bug
3.修复了Emotion Aura的描述没有被正确更新的Bug
4.修复了Blades of Grass计数错误的Bug（此为官方版本存在的Bug）
5.现在可以使用密码norocket关闭火箭队模式了
6.现在即使是自动保存的存档也会应用正确的保存格式了
7.现在濒死复活机制的提示文本将完整显示是哪一方的哪一只精灵
8.现在在尝试开启随机模式时将显示随机模式已被禁用的提示文本
9.在按键说明里加入了不要修改默认键位的提示，因为修改键位可能会导致Bug
10.补上了一部分缺少的Credits，现在这部分Credits应该可以在游戏最后感谢名单里被正确显示了
11.现在濒死复活机制只会在和训练师的战斗中生效

v0.1.0
1.现在特性图鉴也会应用高亮系统了
2.现在物品图鉴也会应用高亮系统了
3.现在如果有必要，会显示特性的更加详细的数据信息了
4.修改了部分语法不正确的文本
5.优化了特性图鉴的分类逻辑
6.优化了精灵概览界面的物品详情显示逻辑，现在不会再做多余的运算了
7.优化了精灵概览界面的特性详情显示逻辑，现在不会再做多余的运算了
8.优化了Pluripotence在复制特性时的显示逻辑，现在会在一条消息里显示某个精灵所有被复制的特性
9.更新了R.O.W.E.的STAB系统，现在单属性精灵的本系加成为1.5倍，多属性精灵的本系加成为1.25倍
10.更新了新的技能威力属性加成机制，使用的技能与攻击方队伍里的其他未处于濒死状态的精灵具有相同的属性，就会有加成（每只单属性精灵加成10%，多属性精灵加成5%）
11.更新了新的技能威力属性削减机制，使用的技能与被击方队伍里的其他未处于濒死状态的精灵具有相同的属性，就会有削减（每只单属性精灵削减10%，多属性精灵削减5%）

v0.0.9
1.修复了某些情况下查看战斗信息时特性显示错误的Bug
2.修复了AI在某些情况下会错误的更新玩家精灵的特性的Bug
3.修复了Young Again在某些情况下会应用错误的退化数据的Bug
4.现在可以在精灵的概览界面的第二页按USE键（A键）查看精灵携带的物品的详情了
5.现在在开始新游戏时会要求输入游戏的合法来源
6.增加了物品图鉴功能，你可以在物品图鉴里查询游戏中所有可用的可携带物品的信息
7.将游戏使用的外部Gem移动到Data文件夹下，现在可将之前下载的版本中的位于主目录中的Gem文件夹删除

v0.0.8
1.现在精灵的概览界面会更详细的显示精灵主特性的生效情况
2.现在可以直接将Dimension D中的精灵放到时间胶囊中了
3.现在在队伍界面按D键展示队伍时，会正确显示精灵的主特性了
4.现在和战斗模拟器中的队伍对战获得胜利时将不再获得金钱
5.现在在队伍界面按D键展示队伍时，会显示当前的所有获胜和失败计数了
6.增加了新的特性，包括之前的各个版本的自适应AI，此条以后将不再记录，只有当精灵的特性确实有发生改变时才会进行说明
7.还原对Perennial Payload的加强

v0.0.7
1.现在AI能够粗略的识别自适应AI的v4版
2.现在各个版本的自适应AI都将不会对变化类技能生效
3.还原在之前的更新中对特性描述文本的更改
4.还原在之前的更新中对地图事件的更改
5.取消了对精灵特性的合法性检测，因为这会使某个NPC的特性变为非预期的特性
6.现在当精灵的物种或者形态改变时，特性会正确的改变和发动了
7.将Displaying Ability（主显特性）改为Main Ability（主特性），默认情况下主特性为随机一个物种特性，物种特性即为该精灵的物种所拥有的特性
8.现在主特性为精灵的常驻特性，主特性在一定条件下可以修改，也只能通过手动修改来改变主特性，主特性也即是自选特性
9.现在精灵的特性分为主特性、物种特性和额外特性，精灵拥有的所有特性都会同时生效，但是任何相同的特性都只会生效一个
10.取消密码nocopymon
11.取消密码copymonagain
12.取消密码adaptiveai
13.调换了战斗结束时完胜检测和是否将对方的队伍加载到战斗模拟器中的顺序
14.修复了当精灵拥有某些允许携带多个物品的特性时，但却无法携带多个物品的Bug
15.修复了Sticky Fingers允许携带多个物品的Bug（此为官方版本存在的Bug，已报告官方）
16.增加了特性记录器，在和训练师的对战中，特性记录器会在对手被打倒时记录对手的特性
17.现在特性记录器不会记录和战斗模拟器中对战的对手的特性
18.引入了特性自选模式，可以通过输入密码customabil开启
19.为特性记录器增加了特性自选功能，在特性自选模式下，可以在队伍菜单中的Modify（修改）中打开特性记录器，使用特性记录器中记录下的特性来修改精灵的主特性
20.特性自选模式开启后，对手训练师的队伍也会相应的变得更强
21.现在可以通过输入密码nocustomabil关闭特性自选功能，关闭后任何精灵的主特性都将不会再生效
22.现在在战斗中查看精灵的信息时将不会再使幻觉暴露
23.修改电脑的盒子数量为200
24.现在在开启火箭队模式时，将在完胜文本显示之后再询问玩家是否要获得对手的精灵
25.现在通过火箭队模式获得的精灵的主特性将会被清除
26.现在可以在精灵的概览页面按A键快速切换到精灵在图鉴中的特性页了
27.现在可以在精灵的概览页面按S键快速切换到精灵在图鉴中的种族值页了

v0.0.6
1.取消按键指引中的关于Space（空格）的说明，因为Space并没有特殊的作用
2.修复了可以通过精灵导航获得在当前游戏阶段本不该能够获得的精灵
3.现在只有角色处于可遭遇精灵的地方时才可使用精灵导航
4.现在可以输入密码nocopymon降低难度
5.现在可以输入密码copymonagain恢复被降低的难度
6.修复了对方的精灵可能会和我方的精灵共用物品的Bug
7.现在濒死复活机制将不会再无意义的显示成为效果

v0.0.5
1.现在可以输入密码rocket开启火箭队模式，火箭队模式可以让玩家在和训练师的战斗获胜后获得一只对方玩家的可以获得的精灵
2.修复了一些特性描述的中文错误翻译，此条在以后的更新中不定时进行，并且不会再单独列出
3.修复了密码输入界面的文本无法正确被翻译的Bug
4.修复了精灵重命名界面的文本无法正确被翻译的Bug
5.删除了大量多余的无效文本，这使得更新补丁可以减少大概0.3MB，此条在以后的更新中不定时进行，并且不会再单独列出
6.现在adaptiveai的功能对在电脑箱子中的精灵也能够使用

v0.0.4
1.现在在使用精灵导航的获得单个精灵的功能时，将只有可以获得的精灵才能被获得，以避免Dimension D中的精灵过多
2.将精灵导航的获得全部精灵的功能改为获得全部精灵中的可以获得的精灵，以避免Dimension D中的精灵过多
3.现在可以在精灵导航界面按R键获得随机一只可以获得的精灵

v0.0.3
1.再次优化了自适应AI的v1-v3的这3个版本的代码结构，以最大限度减少不必要的计算
2.修复了在精灵的形态发生转换时游戏崩溃的Bug

v0.0.2
1.优化了自适应AI（Adaptive AI）的v1-v3的这3个版本的代码结构，现在AI能够正确识别这些自适应AI特性了
2.优化了AI计算自适应AI的v1-v3的这3个版本的逻辑，现在在非必要时不会重新计算了，大大加快了使用技能前的等待时间
3.现在濒死复活机制的复活回合数为10回合
4.暂时移除场地系统，现在将不会自动生成场地了
5.取消可以在精灵的概览界面通过特性胶囊切换主显特性的功能，因为在极端情况下这会产生Bug
6.现在可以输入密码adaptiveai获得隐藏权限，隐藏权限可以让玩家直接把精灵的特性改为自适应AI（官方外挂）

v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
12.添加了特性的合法性检测，会自动移除非法特性
13.现在捕捉精灵后，会正确显示精灵的特性了
14.现在精灵进化后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在官方游戏的版本也会自动更新生成了
21.加入了场地系统，目前共有11个场地，战斗开始时会随机生成一个对对方有利的场地
22.现在可以在游戏中按Q键进行2倍速加速了，但是战斗并不会被加速
23.现在可以在游戏中通过按住V键快速略过对话了
24.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
25.现在在游戏中可以按住X键（BACK）进行奔跑
26.修复了各种指南中相关的文本指引以和当前游戏匹配
27.修复了大量的Pokémon的e上没有重音符号的文本问题
28.现在最多可以支持精灵在战斗中拥有8个技能的情况了
29.现在在游戏中快速存档的按键是W键
30.现在可以在背包中按R键快速注册物品了
31.现在当精灵携带了某个物品时会额外获得一个特性
32.现在当开启困难模式时，某个训练师的所有精灵会额外拥有一个特性
33.现在梦幻的特性不再是复制对手的特性，而是获得对手的特性，并且是在对手出场时立即获得对手的特性，而不是在回合结束时才获得
34.现在某个空间的效果为回合结束时获得一个特性，这个空间会在回合结束时最先发动
35.现在在获得新特性时，能发动的特性都会发动了
36.现在对手训练师的精灵的等级会始终大于或者等于玩家队伍中的精灵的最高等级
37.现在对手训练师的队伍将会更强，不是非法的数值怪或者各种不公平的效果
38.现在在战斗结束时，如果玩家有精灵在战斗中濒死了，则视为战斗失败
39.现在濒死的精灵在7回合之后会复活
40.现在替换下场的精灵会回复10%HP
41.现在某个特性的生效时间由第6回合改为第4回合
42.现在加入了礼物系统
43.现在可以输入hyena1获得1只路边的野狗/输入psyduck10获得1只10级的我最喜欢的死鸭子/输入pokeball5获得5个精灵球
44.现在在精灵导航中无需进入对战即可直接获得精灵
45.现在可以按F快速骑上自行车
46.现在和训练师的战斗结束后所有精灵会回复30%HP、异常以及全部技能的全部PP
47.修改Documents菜单选项名为Tools
48.现在同一种类的精灵，玩家只能拥有一只，获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时可取回该精灵
49.加入了时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取，但是从时间胶囊中取回的精灵的等级将不会超过玩家当前阶段的等级上限
50.加入了战斗模拟器功能，可随时将玩家当前的队伍加载到战斗模拟器中，然后镜像对战或者使用其他队伍进行对战
51.现在战斗模拟器可加载的队伍数量没有上限，不仅可以随时删除，并且全存档通用
52.现在战斗模拟器可以加载其他玩家配置的队伍了，并且支持自定义对战模式了（1v1/2v2/1v2/2v1）
53.现在战斗模拟器支持记录对战过的训练师的队伍了，可以自行选择是否记录
54.现在随机模式已被禁用
55.修改了部分按键说明文本以和当前游戏匹配
56.现在在选择主角外观时将不允许取消选择，并且默认为中性外观
57.修改了某些对话的文本以和当前游戏匹配
58.取消了在使用电脑的取出功能时点击队伍出现的无意义的文本
59.修复了某些特性的不正确的描述文本
60.增加了特性图鉴，现在可以在特性图鉴中查看游戏中所有的特性了
LOGGER