MOD_VERSION = "0.0.1"

CHANGE_LOG = <<LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，
但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，
则不会记录在内。
#==============================================================================#
v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
12.添加了特性的合法性检测，会自动移除非法特性
13.现在捕捉精灵后，会正确显示精灵的特性了
14.现在精灵进化后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在官方游戏的版本也会自动更新生成了
21.加入了场地系统，目前共有11个场地
22.现在可以在游戏中按Q键进行2倍速加速了
23.现在可以在游戏中通过按住V键快速略过对话了
24.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
25.现在在游戏中可以按住X键（BACK）进行奔跑
26.修复了Battle Guide中和多特性相关的文本指引
27.修复了大量的Pokémon的e上没有重音符号的文本问题
28.现在最多可以支持精灵在战斗中拥有8个技能的情况了
29.现在Q键的加速将不会对战斗生效
30.现在在游戏中快速存档的按键是W键
31.修复了背包搜索功能中的文本无法被正确翻译的问题
32.现在在背包中搜索物品时，如果搜索不到结果，也会出现提示了
33.现在可以在背包中按R键快速注册物品了
34.修复了物品快捷注册的一些Bug，因为某些非重要物品也是可以注册的
35.现在当精灵携带了某个物品时会额外获得一个特性
36.现在当开启困难模式时，某个训练师的所有精灵会拥有三个特性
37.现在梦幻的特性不再是复制对手的特性，而是获得对手的特性
38.现在梦幻会在对手出场时立即获得对手的特性，而不是在回合结束时才获得
39.现在某个空间的效果为回合结束时获得一个特性
40.现在在获得新特性时，能发动的特性都会发动了
41.修改某个空间效果的发动顺序，现在这个空间会在回合结束时最先发动
42.现在精灵的概览界面会显示精灵当前拥有的所有特性了
43.修复某个空间效果因为对手死亡时而导致的Bug
44.现在对手训练师的精灵的等级会始终大于或者等于玩家队伍中的精灵的最高等级
45.现在对手训练师的队伍将会更强（不是非法的数值怪或者各种不公平的效果）
46.现在在战斗结束时，如果玩家有精灵在战斗中濒死了，则视为战斗失败
47.现在濒死的精灵在一定回合数之后会复活
48.现在替换下场的精灵会回复一定的HP
49.现在某个特性的生效时间由第6回合改为第4回合
50.现在加入了礼物系统
51.现在可以输入hyena1获得1只路边的野狗
52.现在可以输入psyduck10获得1只10级的我最喜欢的死鸭子
53.现在可以输入pokeball5获得5个精灵球
54.现在在精灵导航中无需进入对战即可直接获得精灵
55.

更新计划：
1.重修pbMessage的选择功能，包括概览界面的特性列表显示、背包的物品搜索功能
2.1只精灵也能进行双打，优先级不高，因为很少有身上只有一只精灵的情况
3.少于4个技能时选择技能Bug
4.更多的战斗信息显示，包括显示技能的预计伤害
5.快速扔球
6.固定为连战模式
7.导航教程
8.队伍界面可以直接修改HP
9.队伍界面可以直接回忆技能
10.队伍界面可以直接教学技能
11.队伍界面可以直接分配风格点数
12.导航获得精灵需要消耗一个精灵球
13.精灵球的捕获率改为50%
14.战斗结束后回复50%HP
15.随身电脑
16.箱子数量随动
17.自由单双打
18.战斗记录仪
19.获胜和失败计数
20.导航额外增加随机获得一只的选项
21.虚拟时间系统
22.无限制睡眠条款
23.无限喷雾
24.概览界面可以转到图鉴的特性和能力界面
25.大礼包
26.无限离洞绳
27.

入场时和回合结束时AI重新检测技能和特性
固定连续对战
走路和跑步模式默认切换
默认跑步模式
默认不起昵称
无限箱子
无限喷雾
无限糖果
无限金钱
无限穿洞绳
捕获率调整
野生闪光精灵入场提示
自定义入场提示
自定义离场提示
命中要害红色显示
中文输入
列表中文搜索
黑暗区域自动闪光
AI控制玩家对战
双打模式
精灵必定捕捉
训练师对战禁用背包
特性条出现声音提示
濒死精灵永久死亡
钓竿必定会咬钩
同一种类的精灵只能拥有一只
精灵不能释放
特性的强化效果一次出场只会发动一次
强化类技能一次出场只能使用一次
全部状态通用的睡眠条款
对战后精灵自动回复
击败野生精灵掉落药品
击败训练师掉落技能机
同一边可以同时显示多个特性条
获得物品
氛围加成，最多属性的属性威力增加10%
使用的技能与我方队伍里其他精灵相同属性，就会有加成（单属性加成20%倍，多属性加成10%倍）
使用的技能与对方队伍里其他精灵相同属性，就会有削弱（单属性就变成10%，多属性就是5%）
携带了传说石板的阿尔宙斯被攻击时会切换成攻击技能的属性


关于游戏：
Demanding Yellow（DY）是一款和Elite Redux类似的游戏。

游戏简介：
这个世界上存在着一种神奇的生物，我们人类把它们叫做口袋妖怪，因为它们可以通过一种特殊的装置随身携带。
口袋妖怪也叫做精灵，相应的这种特殊的装置被称为精灵球。
目前，绝大部分的精灵已经成为了人类的奴隶，人类驱使精灵进行战斗，精灵就是人类用来对战取乐的工具。

而你，你是出生在关都真新镇的一个没有感情的对战工具人。
你热衷于对战，你唯一的理想就是成为精灵联盟的冠军。
为此你从镇子里研究精灵的精灵博士那里要来了你的第一只精灵，你的对战之旅开始了...

游戏特色：
纯对战难度向同人游戏
目前游戏的地区为关都地区
具有官方游戏的全世代精灵/特性/技能/物品
应用第9代机制/技能池
经过定制化调整的战斗AI
经过改进的Mega进化机制
经过优化的钛晶化系统
增加了几百个新精灵/新技能/新特性
重新排列的图鉴
Elite Redux的多特性系统（高优先级）
Reborn系的场地系统（高优先级）
Exceeded的多物品系统（较低优先级）
ROWE的STAB机制
战斗胜利不再获得经验值
战斗胜利不再获得金钱
新的金币点数机制
可选的金币点数和精灵交换机制
敌我双方均没有努力值
动态等级
等级限制
濒死永久死亡
替换回血机制
战败强制重新读档
每种图鉴编号的精灵只能拥有一只
强化类特性每次出场只会发动一次
强化类技能每次出场只能使用一次
全异常状态应用睡眠条款
重复对战功能
痛苦模式

QOL相关：
可直接修改精灵的昵称/等级/特性/技能/性格/个体值/觉醒力量类型/性别
乔伊直接赠送全物品
无限的背包空间
无限的PC盒子
可查看和切换的区域精灵遭遇表
永久喷雾
无限离洞绳
战斗中显示各项参数
战斗中消耗的物品将在战斗后恢复
战斗后精灵自动回复
技能伤害显示
技能PP自动最大化
开局级获得图鉴/跑步鞋/钓竿
全功能图鉴
开局即获得全图鉴资料
随身PC
百分百捕捉
快速孵蛋
HM不用带工具宠
所有精灵都是等级进化
手动进化
游戏加速功能
自动跑步功能
多存档功能

经过改进的Mega进化机制：
现在Mega进化不再需要Mega手环
现在Mega进化精灵不再需要携带Mega石
Mega进化之后携带的道具失效
现在不再限制Mega进化的使用次数
现在Mega进化需要精灵至少达到50级
现在Mega进化需要消耗6点金币点数
金币点数可在对战胜利后获得
获得的金币点数为该场对战对手的精灵数

可选的金币点数和精灵交换机制：
战斗后，如果对手的精灵超过3只，那么可以放弃获得金币点数，而是获得对手的一只精灵。

动态等级：
对手精灵的等级为我方队伍中最高等级精灵的等级。

替换回血机制：
替换下场后，可回复10%HP。

全异常状态应用睡眠条款：
所有异常状态都应用随眠条款，即——比如麻痹，如果对手的队伍中已经有精灵麻痹了，那么就不再能麻痹对手的第二只精灵了。
即，每种异常状态只会有一只精灵存在。

LOGGER

CHANGE_LOG.gsub!("\n", "\r\n")

file = File.open("release_version.txt", "wb")
file.write(Settings::GAME_VERSION)
file.close

file = File.open("release_version_mod.txt", "wb")
file.write(CHANGE_LOG)
file.close