MOD_VERSION = "0.0.1"

CHANGE_LOG = <<LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，
但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，
则不会记录在内。
#==============================================================================#
v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.现在无论如何AI都会知道玩家精灵当前所携带的所有物品
12.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
13.添加了特性的合法性检测，检测到非法特性时会将其还原为随机的一个合法特性
14.现在捕捉精灵后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在当玩家的精灵第一次濒死时，会提示是否直接放弃对战了
21.现在官方游戏的版本也会自动更新生成了
22.加入了场地系统，目前共有11个场地
23.现在可以在游戏中按Q键进行2倍速加速了
24.现在可以在游戏中通过按住V键快速略过对话了
25.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
26.现在在游戏中可以按住X键（BACK）进行奔跑
27.修复了Battle Guide中和多特性相关的文本指引
28.修复了大量的Pokémon的e上没有重音符号的文本问题
29.现在最多可以支持精灵在战斗中拥有8个技能的情况了
30.现在Q键的加速将不会对战斗生效
31.现在在游戏中快速存档的按键是W键
32.修复了背包搜索功能中的文本无法被正确翻译的问题
33.
LOGGER

CHANGE_LOG.gsub!("\n", "\r\n")

file = File.open("release_version.txt", "wb")
file.write(Settings::GAME_VERSION)
file.close

file = File.open("release_version_mod.txt", "wb")
file.write(CHANGE_LOG)
file.close