MOD_VERSION = "0.0.1"

CHANGE_LOG = <<LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，
但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，
则不会记录在内。
#==============================================================================#
v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
12.添加了特性的合法性检测，会自动移除非法特性
13.现在捕捉精灵后，会正确显示精灵的特性了
14.现在精灵进化后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在官方游戏的版本也会自动更新生成了
21.加入了场地系统，目前共有11个场地
22.现在可以在游戏中按Q键进行2倍速加速了
23.现在可以在游戏中通过按住V键快速略过对话了
24.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
25.现在在游戏中可以按住X键（BACK）进行奔跑
26.修复了Battle Guide中和多特性相关的文本指引
27.修复了大量的Pokémon的e上没有重音符号的文本问题
28.现在最多可以支持精灵在战斗中拥有8个技能的情况了
29.现在Q键的加速将不会对战斗生效
30.现在在游戏中快速存档的按键是W键
31.修复了背包搜索功能中的文本无法被正确翻译的问题
32.现在在背包中搜索物品时，如果搜索不到结果，也会出现提示了
33.现在可以在背包中按R键快速注册物品了
34.修复了物品快捷注册的一些Bug，因为某些非重要物品也是可以注册的
35.现在当精灵携带了某个物品时会额外获得一个特性
36.现在当开启困难模式时，某个训练师的所有精灵会拥有三个特性
37.现在梦幻的特性不再是复制对手的特性，而是获得对手的特性
38.现在梦幻会在对手出场时立即获得对手的特性，而不是在回合结束时才获得
39.现在某个空间的效果为回合结束时获得一个特性
40.现在在获得新特性时，能发动的特性都会发动了
41.修改某个空间效果的发动顺序，现在这个空间会在回合结束时最先发动
42.现在精灵的概览界面会显示精灵当前拥有的所有特性了
43.修复某个空间效果因为对手死亡时而导致的Bug
44.现在对手训练师的精灵的等级会始终大于或者等于玩家队伍中的精灵的最高等级
45.现在对手训练师的队伍将会更强（不是非法的数值怪或者各种不公平的效果）
46.现在在战斗结束时，如果玩家有精灵在战斗中濒死了，则视为战斗失败
47.现在濒死的精灵在一定回合数之后会复活
48.现在替换下场的精灵会回复一定的HP
49.现在某个特性的生效时间由第6回合改为第4回合
50.现在加入了礼物系统
51.现在可以输入hyena1获得1只路边的野狗
52.现在可以输入psyduck10获得1只10级的我最喜欢的死鸭子
53.现在可以输入pokeball5获得5个精灵球
54.

更新计划：
1.重修pbMessage的选择功能，包括概览界面的特性列表显示、背包的物品搜索功能
2.1只精灵也能进行双打，优先级不高，因为很少有身上只有一只精灵的情况
3.少于4个技能时选择技能Bug
4.

LOGGER

CHANGE_LOG.gsub!("\n", "\r\n")

file = File.open("release_version.txt", "wb")
file.write(Settings::GAME_VERSION)
file.close

file = File.open("release_version_mod.txt", "wb")
file.write(CHANGE_LOG)
file.close