MOD_VERSION = "0.0.2"

CHANGE_LOG = <<LOGGER
#==============================================================================#
Pokémon Tectonic: Earthquake
by Fanfan
v#{MOD_VERSION}
#==============================================================================#
以下部分记录了此游戏相对于官方游戏的所有更改，但是只会记录可能会影响到玩家的更改，
一些内部的和玩家无关的代码整理优化等，则不会记录在内。
#==============================================================================#
游戏特色：
完全包括Pokémon Tectonic官方游戏的全部内容
完全重置的全新的口袋妖怪同人游戏
对战难度向口袋妖怪同人游戏
1-8代的全精灵以及这些精灵在9代获得的进化型
一些原创的精灵以及地区形态
经过大量挑选/删除/修改的原版特性/技能/物品
没有Mega进化/Z技能/极巨化/钛晶化系统
几百个全新的原创特性/原创技能
一些全新的原创物品
每一只精灵的种族值/特性/技能池都经过精心调整
各种反作弊检测以及特性和技能的合法性检测，杜绝作弊的可能性
经过优化的属性克制表
经过定制化调整的战斗AI，AI不会作弊，也不会窥屏
类Elite Redux的多特性系统，精灵所拥有的所有特性都会同时生效
类Reborn系的场地系统，会随机生成一个对对方有利的场地
类Exceeded的多物品系统，某些精灵可以携带多个物品
类Elite Redux的精灵导航，可以直接获得想要的精灵，而无需进入战斗捕捉
经过完全修改的精灵图鉴，可以查询你需要的任何有关精灵的资料
开局即获得除神兽之外的全图鉴资料
新的技能图鉴，可以查询你需要的任何有关技能的资料
新的特性图鉴，可以查询你需要的任何有关特性的资料
敌我双方均没有努力值/个体值/性格加成
新的经过优化的风格点数来自行分配加点
经过优化的技能学习方式，现在技能只分为升级技能和教学技能
动态等级，对方的精灵的等级将始终大于或者等于玩家队伍中等级最高的精灵的等级
阶段性等级上限
经验分配器功能，经验值绝对不会被浪费，精灵等级达到上限并且获得经验值时，经验值将会被存储在经验分配器中，可利用经验分配器中的经验制作经验糖果
替换回血机制，进行替换时，精灵将会回复10%HP
濒死复活机制，濒死的精灵经过7回合之后会复活
对战完胜机制，对战结束时，若队伍中有在战斗中濒死的精灵，则视为失败
物品恢复机制，战斗中消耗的物品将在战斗后恢复
战后回复机制，和训练师的战斗结束后，所有精灵会回复30%HP、异常以及全部技能的全部PP
精灵唯一性机制，同一种类的精灵，玩家只能拥有一只，获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时才可取回
战斗模拟器功能，可记录下所有对战过的训练师的队伍，而且也可自行为AI配置队伍，或者加载其他玩家配置的队伍进行模拟对战
部族系统，每一只精灵有它所属的部族，同一队伍的部族数达到5个时将获得额外的效果
时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取
塔罗牌困难模式，开启后对方将会获得一个Buff，此为此游戏的唯一一个不公平选项，可自行选择是否开启
游戏加速功能，快捷键Q，但是战斗不会被加速
快速略过对话功能，快捷键V
快速存档功能，快捷键W
多存档功能
可恢复的随身急救包
可直接修改精灵的昵称
技能伤害显示
战斗中显示各项参数
可直接快速放弃对战
战斗中无法使用物品
固定连战模式
无限的背包空间
背包物品搜索功能，快捷键D
快速注册物品，快捷键R
精灵寄放系统的搜索功能
礼物系统
精灵跟随系统
经过优化的HM，不用再带工具宠
可选的手动进化功能
其他各种微小的机制改进/细节优化/Qol提升

v0.0.2
1.

v0.0.1
1.同步官方更新，每一次更新时都会同步官方更新，后续将不再单独列出
2.将Mod命名为Earthquake，即地震
3.现在在游戏的主文件夹下会自动生动更新记录，并保存在release_version_mod.txt中
4.修复了和原始天气相关的一些文本不能被正确翻译的问题
5.现在精灵所拥有的所有特性都会同时生效，无论是对战内，还是对战外
6.现在精灵的特性分为主特性和副特性，主特性即精灵的概览界面所显示的特性
7.现在对战信息里会显示精灵当前生效的所有特性
8.现在特性发动时会出现“Biu~”的音效了
9.现在无论如何AI都会知道玩家精灵当前的所有特性
10.现在无论如何AI都会知道玩家精灵当前的所有技能
11.对于某些可能的情况，现在AI将会进行更好的预测，而不是默认以最坏的情况进行处理
12.添加了特性的合法性检测，会自动移除非法特性
13.现在捕捉精灵后，会正确显示精灵的特性了
14.现在精灵进化后，会正确显示精灵的特性了
15.现在可以在精灵的概览界面查看精灵的全部特性了，包括特性名和特性描述
16.现在可以在精灵的概览界面切换精灵的显示特性了，切换需消耗一个特性胶囊
17.修复了特性胶囊的文本
18.现在可以在精灵的概览界面切换到图鉴查看精灵了
19.现在可以在背包中按D键（SPECIAL）进行搜索了
20.现在官方游戏的版本也会自动更新生成了
21.加入了场地系统，目前共有11个场地，战斗开始时会随机生成一个对对方有利的场地
22.现在可以在游戏中按Q键进行2倍速加速了，但是战斗并不会被加速
23.现在可以在游戏中通过按住V键快速略过对话了
24.现在在游戏中可以通过按Z键（ACTION）来打开菜单，以和最新版的ESS进行匹配
25.现在在游戏中可以按住X键（BACK）进行奔跑
26.修复了各种指南中相关的文本指引以和当前游戏匹配
27.修复了大量的Pokémon的e上没有重音符号的文本问题
28.现在最多可以支持精灵在战斗中拥有8个技能的情况了
29.现在在游戏中快速存档的按键是W键
30.现在可以在背包中按R键快速注册物品了
31.现在当精灵携带了某个物品时会额外获得一个特性
32.现在当开启困难模式时，某个训练师的所有精灵会拥有三个特性
33.现在梦幻的特性不再是复制对手的特性，而是获得对手的特性，并且是在对手出场时立即获得对手的特性，而不是在回合结束时才获得
34.现在某个空间的效果为回合结束时获得一个特性，这个空间会在回合结束时最先发动
35.现在在获得新特性时，能发动的特性都会发动了
36.现在对手训练师的精灵的等级会始终大于或者等于玩家队伍中的精灵的最高等级
37.现在对手训练师的队伍将会更强，不是非法的数值怪或者各种不公平的效果
38.现在在战斗结束时，如果玩家有精灵在战斗中濒死了，则视为战斗失败
39.现在濒死的精灵在7回合之后会复活
40.现在替换下场的精灵会回复10%HP
41.现在某个特性的生效时间由第6回合改为第4回合
42.现在加入了礼物系统
43.现在可以输入hyena1获得1只路边的野狗/输入psyduck10获得1只10级的我最喜欢的死鸭子/输入pokeball5获得5个精灵球
44.现在在精灵导航中无需进入对战即可直接获得精灵
45.现在可以按F快速骑上自行车
46.现在和训练师的战斗结束后所有精灵会回复30%HP、异常以及全部技能的全部PP
47.修改Documents菜单选项名为Tools
48.现在同一种类的精灵，玩家只能拥有一只，获得已拥有的精灵时，该精灵将会被传送到Dimension D中，当条件允许时可取回该精灵
49.加入了时间胶囊功能，玩家可以将精灵放入时间胶囊中，时间胶囊中的精灵可以在所有存档之间存取，但是从时间胶囊中取回的精灵的等级将不会超过玩家当前阶段的等级上限
50.加入了战斗模拟器功能，可随时将玩家当前的队伍加载到战斗模拟器中，然后镜像对战或者使用其他队伍进行对战
51.现在战斗模拟器可加载的队伍数量没有上限，不仅可以随时删除，并且全存档通用
52.现在战斗模拟器可以加载其他玩家配置的队伍了，并且支持自定义对战模式了（1v1/2v2/1v2/2v1）
53.现在战斗模拟器支持记录对战过的训练师的队伍了，可以自行选择是否记录
54.现在随机模式已被禁用
55.修改了部分按键说明文本以和当前游戏匹配
56.现在在选择主角外观时将不允许取消选择，并且默认为中性外观
57.修改了某些对话的文本以和当前游戏匹配
58.取消了在使用电脑的取出功能时点击队伍出现的无意义的文本
59.修复了某些特性的不正确的描述文本
60.增加了特性图鉴，现在可以在特性图鉴中查看游戏中所有的特性了
LOGGER

=begin
优化第四版Adaptive AI，优化Adaptive AI的AI计算
获胜和失败计数
队伍切换器
Dimension D/时间胶囊/战斗模拟器/队伍切换器/教程
将精灵从Dimension D移动到时间胶囊中
重修pbMessage的选择功能，包括概览界面的特性列表显示、背包的物品搜索功能
更多的战斗信息显示，包括显示技能的预计伤害
队伍界面可以直接修改HP/回忆技能/教学技能/分配风格点数
快速扔球
精灵球的捕获率改为50%
随身电脑
自由单双打，1只精灵也能进行双打，优先级不高，因为很少有身上只有一只精灵的情况
导航额外增加随机获得一只的选项
概览界面可以转到图鉴的特性和能力界面
自定义入场/离场提示
命中要害红色显示
AI控制玩家对战
同一边可以同时显示多个特性条
氛围加成，最多属性的属性威力增加10%
ROWE的STAB机制，使用的技能与我方队伍里其他精灵相同属性，就会有加成（单属性加成20%倍，多属性加成10%倍），使用的技能与对方队伍里其他精灵相同属性，就会有削弱（单属性就变成10%，多属性就是5%）
携带了传说石板的阿尔宙斯被攻击时会切换成攻击技能的属性
乔伊直接赠送全物品
无限的PC盒子
永久喷雾
无限离洞绳
全异常状态应用睡眠条款
完善反作弊机制(RMXP地图/PBS/贴吧/某人的插件代码导出)
中文换行
中文拼音输入法
更改自动保存的格式
自动更新
联机对战
=end

file = File.open("release_version.txt", "wb")
file.write(Settings::GAME_VERSION)
file.close

file = File.open("release_version_mod.txt", "wb")
file.write(CHANGE_LOG.gsub("\n", "\r\n"))
file.close